[
    {
      "referenceid": 1,
      "name": "Charles Dobson",
      "organization": "ATCO Structures and Logistics",
      "position": "Senior Proposal Director",
      "project": "Win Strategy and Other Training Michèle Conducted in Calgary in 2012-2013",
      "content": "Michèle Rochon provided a variety of services to ATCO Structures and Logistics over a number of years. This began with a workshop Michèle conducted on behalf of Shipley Canada on the topic of proposal management and positioning to win. I found Michèle to be a capable trainer, so I hired her to provide additional training in our office. Michèle performed an analysis of our operation based on the Business Development Capability Maturity Model. She then provided training in her 10 Steps to a Win Theme technique, which was featured in Proposal Management Magazine in 2010, I believe. This was extremely valuable for my team, and the others at ATCO who sat in on the day-long session. Michèle has a strong technique for writing value propositions that helps a team focus first on the specific issues and challenges the client faces in the project. I agree with her that teams often jump too quickly to the work of describing our people and expertise, without first understanding what is most relevant to the client. Her technique provided awareness of this, as well as a system for addressing it. Michèle is also an excellent trainer. She took time to understand my team before diving into material. She is highly knowledgeable in capture planning, proposal strategy and business development, and is able to package and convey that knowledge to a cross-section of professionals. We've since had her in the office to not only support our proposals, but also train us on other topics, including the importance of play in stimulating creativity. If I had a suitable position, I would hire Michèle in a heartbeat. I would like to have her here to provide ongoing coaching to personnel in many levels of the organization."
    },
    {
        "referenceid": 2,
        "name": "Doug Braun",
        "organization": "Stantec",
        "position": "Senior Project Manager, First Nations",
        "project": "Win Strategy and Other Training Michèle Conducted in Calgary in 2012-2013",
        "content": "On March 14, 2018, the Stantec Winnipeg office made company history when we were awarded the Nisichawaysihk Cree Nation New Health Facility Project, including architectural design and construction with a total construction value of $20M. The team competed with several global consultants for the work. First Nation client revenues grew in the Winnipeg office from $620K in 2015 to $1.4M in 2017, and it looks like 2018 has put ISC second only to Manitoba Hydro for highest regional project earnings. The same week, the Manitoba Water BC (my team) won the fourth in a series of important water and wastewater projects with the province's First Nations communities. The Wuskwi Sipihk First Nation community awarded their water treatment plant and lagoon design and construction project to us. The proposal evaluators, made up of Wuskwi Sipihk council members, Indigenous Services Canada (ISC and formerly known as Indigenous and Northern Affairs Canada (INAC)) representatives, and project management firm, Colliers Project Leaders, indicated to me that they appreciated the detailed project understanding. It demonstrated a “thorough grasp” of the unique technical challenges the community faced with their water and wastewater infrastructure. They told me the proposal read like a book. I had been with Stantec since 2006 and worked primarily on projects with strategic clients like Manitoba Hydro and Manitoba Water Services Board. In 2016, I was determined to connect with the First Nations in Manitoba to expand Stantec's profile there, because I knew ISC was spending on water infrastructure. From a business development perspective, this was a new challenge for the team. They hadn't been submitting many proposals for First Nations projects in recent years, and the ones they did submit weren't getting results. The proposal itself is a key component in the process. In general, First Nations evaluators respond most favorably to visual messaging. A proposal manager, writer, and graphic artist, Michèle started with Stantec around the time I began this effort to expand our reach in the First Nations communities. I explained to Michèle what I wanted to achieve, not only with the proposals, but with managing the whole life cycle of First Nations project opportunities to position us to win. For each proposal, Michèle led us in a series of proposal planning exercises, including her method, 10 Steps to a Win Theme and her rapid-fire methodology exercise. Because of that, we were able to prepare the technical work plan, fee, and schedule in a fraction of the time. Michèle also designed a new proposal template and graphics to express key messages using less text. These included a “centerfold” summarized schedule, section summaries on the dividers, and icon way-finders throughout the document to indicate First Nation community involvement and skills transfer opportunities for community members. Michèle created a feather icon as a way for the First Nation evaluators to locate milestones in the project during which members of the community would be invited to get involved. For example, employment opportunities might be available when surveying, or clearing brush from sites for construction, or as translators for public meetings. Michèle placed these on the inside margin of the task in the work plan and in the schedule. The work plans provided these markers on a significant percentage of the project tasks - a deciding factor in the wins. This was Michèle's idea, and all the evaluation teams liked it. After several debrief sessions on unsuccessful proposals during which I gathered feedback on our submissions, (with Michèle's coaching), the first successful bid with Peguis First Nation was awarded in 2016. Shortly after Peguis, the team was awarded Wasagamack First Nation Sewage Treatment Plant for $600K. Within a few months Stantec was awarded the Kinonjeoshtegon First Nation Water Treatment Plant and Associated Works project for $670K. Stantec's win on Wuskwi Sipihk added a fourth water project to the list. We'd never had this many FN projects going at one time with this volume of work. Michèle and I went on to tell this story to the other units and made available to all (Transportation, Environmental, Buildings) the tools she developed. I believe this was instrumental in securing those other wins as well, because I observed those teams applying her techniques and designs and going on to win. Though we always do business development as a team, I credit Michèle with leading us to a more effective overall approach."
    },
{
    "referenceid": 3,
    "name": "Meredith Rose Nelson",
    "organization": "N/A",
    "position": "Fellow Student, University of Toronto ConEd Creative Writing",
    "project": "N/A",
    "content": "The course at University of Toronto, Creative Writing included peer review on our writing. Michele's comments on my work were encouraging and valuable. She was always careful to note the strong points in my writing and explain why it was poignant for her. Michele also helped me with editing and improving my work. She is knowledgeable in writing standards, but also helped me express myself creatively."
},

{
    "referenceid": 4,
    "name": "Tom Marrs, Ph.D.",
    "organization": "Texas A&M University, Center for Executive Development",
    "position": "Executive Director",
    "project": "Workplace Culture Training Program, Oil and Gas Client in Texas",
    "content": "Michele provided her session, Workplace Culture Bingo, for our clients, Ascend Technologies here in the Center for executive Development at Texas A&M in April 2020. The session was innovative and engaging. We used the tool she developed, a sophisticated form of bingo during which we would gather data about the client's current workplace culture and engage in planning exercises for building on successes and phasing out some programming."
},

{
    "referenceid": 5,
    "name": "Eugenie Cyr",
    "organization": "Research Manager, Research Directorate, Immigration and Refugee Board of Canada",
    "position": "Research Director",
    "project": "Workplace Culture Training Program, Oil and Gas Client in Texas",
    "content": "Our Directorate utilized Michele Rochon's session on establishing a healthy workplace culture through the use of play as part of a Directorate retreat. The content was engaging and thoughtful! We enjoyed the use of breakout groups and large group discussion to identify how play can be part of a healthy and productive workplace. "
},

{
    "referenceid": 6,
    "name": "Caitlyn Grabham",
    "organization": "N/A",
    "position": "N/A",
    "project": "University of Toronto ConEd Creative Writing",
    "content": "I recently took a course at University of Toronto with Michele, Creative Writing. As part of the course requirements, we provided each other with peer review on our writing. Michele's comments on my work were extremely helpful. She always led with positive and encouraging feedback, noticing first what she liked about my submitted piece and where its strengths were. She also provided constructive criticism on where she thought I could improve. I would enthusiastically recommend Michele for tutoring, editing or teaching work."
}

  ]
  